creatMMTelUser

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://localhost:8080/imsservice/services/CentrexService">
  <SOAP-ENV:Header>
	<m:Security xmlns:m="http://wsse.centrex.imsservice.chinamobile.com">
			<m:UsernameToken>
			  <m:Username>^<GLOBAL_USER^></m:Username>
		    <m:Password>^<GLOBAL_PASSWD^></m:Password>
	    </m:UsernameToken>
    </m:Security>
  </SOAP-ENV:Header>
	<SOAP-ENV:Body>
      <m:creatUser xmlns:m="http://msg.centrex.imsservice.chinamobile.com">
				<m:user>
            <name>+8610^<BILL_ID^></name>
            <Address>
              <UserLongNumber>+8610^<BILL_ID^></UserLongNumber>
            </Address>
            <UserType><value>0</value></UserType>
            <UserLockFLG>^<USERLOCKFLG^></UserLockFLG>
            <portalAccount>
               <enableAccount>^<USER_PORTALACCOUNT_ENABLEACCOUNT^></enableAccount>
               <loginName>+8610^<BILL_ID^></loginName>
               <passWord>135246</passWord>
            </portalAccount>
            <MultiUserFLG><value>1</value></MultiUserFLG>
         </m:user>
				<m:serviceEntry>
            <item>
              <ServiceCode>CallingLineIdentificationPresentation</ServiceCode>
              <EnableFlag><value>^<CallingLineIdentificationPresentation^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallingLineIdentificationRestriction</ServiceCode>
              <EnableFlag><value>^<CallingLineIdentificationRestriction^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallingLineIdentificationRestrictionOverride</ServiceCode>
              <EnableFlag><value>^<CallingLineIdentificationRestrictionOverride^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallWaiting</ServiceCode>
              <EnableFlag><value>^<CallWaiting^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallHold</ServiceCode>
              <EnableFlag><value>^<CallHold^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallForwardingUnconditional</ServiceCode>
              <EnableFlag><value>^<CallForwardingUnconditional^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallForwardingBusy</ServiceCode>
              <EnableFlag><value>^<CallForwardingBusy^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallForwardingNoReply</ServiceCode>
              <EnableFlag><value>^<CallForwardingNoReply^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallForwardingOffline</ServiceCode>
              <EnableFlag><value>^<CallForwardingOffline^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallBarring</ServiceCode>
              <EnableFlag><value>^<CallBarring^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>DoNotDisturb</ServiceCode>
              <EnableFlag><value>^<DoNotDisturb^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>SettingServiceOverstep</ServiceCode>
              <EnableFlag><value>^<SettingServiceOverstep^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>BlindCallTransfer</ServiceCode>
              <EnableFlag><value>^<BlindCallTransfer^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>ConsultativeCallTransfer</ServiceCode>
              <EnableFlag><value>^<ConsultativeCallTransfer^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>ThreePartyService</ServiceCode>
              <EnableFlag><value>^<ThreePartyService^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>VirtualAttendantConsole</ServiceCode>
              <EnableFlag><value>^<VirtualAttendantConsole^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>AttendantEnb</ServiceCode>
              <EnableFlag><value>^<AttendantEnb^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>Fax</ServiceCode>
              <EnableFlag><value>^<Fax^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CallContinue</ServiceCode>
              <EnableFlag><value>^<CallContinue^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>ConvenientNumber</ServiceCode>
              <EnableFlag><value>^<ConvenientNumber^></value></EnableFlag>
            </item>
            <item>
              <ServiceCode>CTD</ServiceCode>
              <EnableFlag><value>^<CTD^></value></EnableFlag>
            </item>
         </m:serviceEntry>
			   <m:UserAddInfo>
            <Postcode>^<POSTCODE^></Postcode>
            <IMPI>8610^<BILL_ID^>@ims.bj.chinamobile.com</IMPI>
            <IMPUList>
              <m0:item>sip:+8610^<BILL_ID^>@ims.bj.chinamobile.com</m0:item>
              <m0:item>tel:+8610^<BILL_ID^></m0:item>
            </IMPUList>
            <ServiceType>^<ServiceType^></ServiceType>
         </m:UserAddInfo>
		</m:creatUser>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>